Repository: Dacasti02/24436116L
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: (laughs)
es_es: (risas)

source: Resident Evil Village’s opening hour establishes an incredibly tense tone, weaving together moody, atmospheric horror with rollercoaster firefights that leave Ethan within an inch of his life.
es_es: La primera hora de Resident Evil Village establece un tono increíblemente tenso, entremezclando un horror atmosférico y tenebroso con tiroteos que dejan a Ethan al borde de la muerte.

source: Also on Xbox Series X/S, PlayStation VR2, PlayStation 4, PC
es_es: También en Xbox Series X/S, PlayStation VR2, PlayStation 4, PC

source: Developer Capcom
es_es: Desarrolladora Capcom

source: Hiroshi Tamura: For the remake, we wanted to pay great attention to the sound throughout the game.
es_es: Hiroshi Tamura: Para la nueva versión, queríamos prestar mucha atención al sonido en todo el juego.¶

source: Kota Suzuki: As Tamura said, we needed to respect the original as we created something new for the remake.
es_es: Kota Suzuki: Como ha dicho Tamura, teníamos que respetar el original a la vez que creaar algo nuevo para la nueva versión.

source: Publisher Capcom
es_es: Editora Capcom

source: Rating Mature
es_es: Clasificación Adulta (+18)

source: Release March 24, 2023
es_es: Lanzamiento 24 de marzo de 2023

source: Reviewed on PlayStation 5
es_es: Analizado en PlayStation 5

source: Suzuki: I share the same feelings.
es_es: Suzuki: Pienso lo mismo.

source: Suzuki: The fights with the enemies in the remake of the RE4 are very interactive.
es_es: Suzuki: Los combates con los enemigos en la nueva versión de RE4 son muy interactivos.

source: Suzuki: There's a lot of music that I like and listen to.
es_es: Suzuki: Hay un montón de música que me gusta y escucho.

source: Suzuki: There's no song that we used as-is from the original.
es_es: Suzuki: No hay ninguna canción del original que hayamos usado tal cual.

source: Suzuki: There's nothing like a main theme for the whole game.
es_es: Suzuki: No hay nada como un tema principal para todo el juego.

source: Tamura: For that sound, the impact, the feel of that sound is something we paid a great deal of attention to.
es_es: Tamura: Prestamos mucha atención a ese sonido, a su impacto y a su sensación.

source: Tamura: This enemy appeared in one of the trailers, but Del Lago.
es_es: Tamura: Este enemigo apareció en uno de los trailers, pero Del Lago.

source: Tamura: Almost all of them are recreated from scratch.
es_es: Tamura: Casi todos ellos se recrearon desde cero.

source: Tamura: An easy one to give as an example would be the environmental sounds that help build space. We gave a lot of attention to that.
es_es: Tamura: Un ejemplo fácil que poner serían los sonidos ambientales que ayudan a construir el espacio. Le hemos prestado mucha atención.

source: Tamura: Even with the power of today's high-end machines, to help reduce processing load, culling is used.
es_es: Tamura: Incluso con la potencia de las máquinas de gama alta de hoy en día, para ayudar a reducir la carga de procesamiento, se utiliza la eliminación selectiva.

source: Tamura: For fans that played the original RE4, I hope they feel a sense of comfort [and] understand just how much care we paid to the original as we created this remake.
es_es: Tamura: Espero que los fans de la versión original de RE4 se sientan reconfortados y además comprendan el cuidado que hemos puesto en el original a la hora de crear esta nueva versión.

source: Tamura: I play games, so when I think about sounds, I find myself thinking of games.
es_es: Tamura: Suelo jugar a videojuegos, así que cuando pienso en los sonidos, me topo con los juegos.

source: Tamura: In the past, it's been used partially in titles like Village.
es_es: Tamura: En el pasado, se ha utilizado parcialmente en títulos como Village.

source: About Game Informer's review system
es_es: Sobre el sistema de análisis de Game Informer

source: Across the board, the cast has received an overhaul, making the protagonists more likable, the enemies more menacing, and the twisting threads of the plot somewhat more coherent – all the while never losing what made the original story so fun in the first place.
es_es: En general, todo el elenco ha sido renovado, haciendo que los protagonistas sean más simpáticos, los enemigos más amenazantes y los hilos entrelazados de la trama, algo más coherentes, sin perder nunca lo que hacía que la historia original fuera tan divertida en primer lugar.

source: Again, we referenced the original, ascertained what the essence of the sound was, and recreated it in a way that respects the original.
es_es: Una vez más, hemos tomado como referencia el original y hemos averiguado cuál era la esencia del sonido para recrearlo respetando el original.

source: All Rights Reserved.
es_es: Todos los derechos reservados.

source: All of this in the remake is made with ambisonic techniques.
es_es: Todo esto en la nueva versión se hace con técnicas ambisonic.

source: All the while, monsters, gore, and death follow.
es_es: Todo eso mientras los monstruos, el "gore" y la muerte te persiguen.

source: Also, even for a battle starting, there's more than just spotting an enemy in front of you.
es_es: Además, incluso para una batalla que comienza, hay algo más que ver a un enemigo frente a ti.

source: Also, for instance, if there's many enemies around you, then the music might be arranged slightly, or maybe the number of instruments might increase.
es_es: También, por ejemplo, si hay muchos enemigos a tu alrededor, la música podría cambiar ligeramente, o tal vez el número de instrumentos podría aumentar.

source: Also, in the remake, we use a feature called room portal.
es_es: Además, en la nueva versión usamos una función llamada portal de sala.

source: Also, the original RE4 had a balance of horror and drama and as a whole, was a highly entertaining experience.
es_es: Además, el RE4 original tenía un equilibrio entre terror y drama y, en conjunto, era una experiencia muy entretenida.

source: Also, there's the sound of the wind.
es_es: También tenemos el sonido del viento.

source: Also, we made sure to balance the low end to add to that impact.
es_es: Además, nos aseguramos de equilibrar los graves para aumentar el impacto.

source: And don't get me started on the game's brutally gross gore system; blasting off heads and arms and even shooting enemies entirely in half as blood flows like confetti out of a pinata has rarely looked this fantastically disgusting.
es_es: Y no me hagas hablar del brutalmente repugnante sistema de "gore" de este juego; el hecho de arrancar cabezas y brazos e incluso partir en dos a los enemigos mientras la sangre fluye como el confeti de una piñata rara vez se ha visto tan fantásticamente asqueroso.

source: And for some tracks, we've taken a different approach.
es_es: Para algunas otras pistas, hemos adoptado un enfoque diferente.

source: And if you're outside, the wind has a speed and direction calculated by the GPU in real-time.
es_es: Si estás fuera, el viento tiene una velocidad y dirección calculada por la GPU en tiempo real.

source: And much of that charm is retained here, but with the addition of much sharper writing and better characterization.
es_es: Y gran parte de ese encanto sigue ahí, pero con el añadido de una escritura más aguda y una mejor caracterización de personajes.

source: And so, while I think it can show you why Resident Evil 4 was fun, goofy, and endearing, if you're someone interested in just why this old game has such an enduring legacy – especially one strong enough to warrant such a massively expensive remake – your best bet is to still play the original, to try and put your mind in a pre-Resident Evil 4 world to understand how that game could change everything.
es_es: Así que, aunque creo que puede mostrarte por qué Resident Evil 4 era divertido, absurdo y entrañable, si te interesa saber por qué este viejo juego tiene un legado tan perdurable (sobre todo tan fuerte como para justificar un remake tan caro), lo mejor que puedes hacer es jugar al original para intentar poner tu mente en un mundo anterior a Resident Evil 4 y entender cómo ese juego pudo cambiarlo todo..

source: And that space is the most interesting place this remake can occupy.
es_es: Y ese espacio es el lugar más interesante que esta nueva versión puede ocupar.

source: And that's important.
es_es: Y eso es importante.

source: And weather sounds, such as rain falling.
es_es: También hay sonidos meteorológicos, como el de la lluvia al caer.

source: And, like an ultramarathon runner, Village maintains this thrilling pace until its closing credits.
es_es: Y, como si de un corredor de ultramaratón se tratase, Village mantiene este ritmo trepidante hasta los créditos finales.

source: Another example is, say you've got grass on the ground and trees swaying and rustling.
es_es: Digamos que otro ejemplo es que hay hierba en el suelo y árboles que se mecen y crujen.

source: Are there any new music tracks in RE4?
es_es: ¿Hay nuevos temas musicales en RE4?

source: As a lifelong fan of the original, seeing some of my favorite levels and combat arenas recreated 1:1 on the PlayStation 5 was novel and fun.
es_es: Como un fan de toda la vida del original, ver algunos de mis niveles favoritos y arenas de combate recreadas a escala idéntica en PlayStation 5 fue novedoso y divertido.

source: As a personal hobby, these games interest me.
es_es: Como afición personal, estos juegos me interesan.

source: As great as this remake is – and let me reiterate, it's incredible – I do not think it will show you why Resident Evil 4 was so groundbreaking.
es_es: Por muy genial que sea este remake (y permitidme reiterar que es increíble), no creo que te muestre por qué Resident Evil 4 fue tan rompedor..

source: As horrific as the game looks, it's the soundtrack and creepy sound effects that do much of the heavy lifting in building fear and tension.
es_es: Tan espantoso como se ve el juego, son la banda sonora y los escalofriantes efectos de sonido los que hacen gran parte del trabajo duro para crear miedo y tensión.

source: As it was in 2005, it's a punch-in-the-face type of opening, the game telling you this is how it will be from here on out; get used to it.
es_es: Al igual que en 2005, esto es como un puñetazo en la cara, el juego te dice que así es como va a ser a partir de ahora; así que ajo y agua.

source: As sound professionals, what iconic sound effects or score stays in your mind?
es_es: Como profesionales del sonido, ¿qué efectos sonoros o partituras icónicas se os quedan grabados en la mente?

source: Ashley, in particular, has been rewritten as a real character with emotions, intelligence, and charisma.
es_es: Ashley, en particular, ha sido reescrita como un personaje real con emociones, inteligencia y carisma.

source: At that village, all hell breaks loose.
es_es: En ese pueblo, se desata el infierno.

source: At the same time, we are releasing the remake as a new game in 2023, using the latest technology.
es_es: Al mismo tiempo, lanzamos la nueva versión en 2023 como si fuese un juego nuevo, con lo último en tecnología.

source: Battlefield, or Call of Duty, things like that.
es_es: Battlefield, o Call of Duty, cosas así.

source: Be sure to click the banner below to visit our Resident Evil 4 cover story hub filled with exclusive features and videos.
es_es: No dejes de hacer clic en la siguiente caja para visitar nuestra portada de Resident Evil 4, repleta de artículos y vídeos exclusivos.

source: Before joining Game Informer he freelanced for outlets such as Polygon, Vice, USG, and Rolling Stone.
es_es: Antes de unirse a Game Informer, trabajó como freelance para medios como Polygon, Vice, USG y Rolling Stone.

source: Between the musical score and sound design, what emotions do you hope to draw out from players?
es_es: Entre la partitura y el diseño sonoro, ¿qué emociones esperas causar en los jugadores?

source: Blake Hester has been writing about the video game industry since 2015.
es_es: Blake Hester escribe sobre la industria del videojuego desde 2015.

source: But as a love letter to one of the greatest games of all time, as a new historical artifact that reinforces why the source material was so landmark in the first place, this new trek through the Spanish countryside is as good as it gets and makes a great game that much better.
es_es: Pero como carta de amor a uno de los mejores juegos de todos los tiempos, como nuevo artefacto histórico que refuerza por qué el material original era tan emblemático en primer lugar, este nuevo viaje por la campiña española no puede ser mejor y hace de un gran juego algo mucho mejor

source: But at the same time, there's also a lot of other sounds that need to be played, and a lot of those are very important as well.
es_es: A la vez que este hay muchos otros sonidos que tienen que sonar, y muchos de ellos son también muy importantes.

source: But for instance, in this remake, if we have a Ganado behind a wall that the player can't possibly see or get to, then from a graphics standpoint, it's fine to turn off, so we cull it, but at the same time, we create another purely sound object in its place.
es_es: Sin embargo, en esta nueva versión, si tenemos un Ganado detrás de un muro que el jugador no puede ver o al que no puede llegar desde un punto de vista gráfico, está bien apagarlo, así que lo eliminamos, pero, al mismo tiempo, creamos otro objeto puramente sonoro en su lugar.

source: But if there's a wall between you and the enemy, you shouldn't be able to hear that from the right.
es_es: Pero si hay un muro entre tú y el enemigo, no deberías poder oírlo desde la derecha.

source: But if we made the sound as realistic as we could here, we would lose the essence of RE4.
es_es: Pero si hiciéramos aquí el sonido tan realista como pudiésemos, perderíamos la esencia de RE4.

source: But importantly, it doesn't overwrite its predecessor.
es_es: Pero lo más importante es que no anula a su predecesor.

source: But roughly speaking, probably about 30% of the tracks keep a melody line from the original or arrange a phrase from the original.
es_es: Pero a grandes rasgos, probablemente el 30% de los temas conservan una línea melódica del original o arreglan una frase del original.

source: But the director told me it was too new sounding and asked that I try and create the feeling of an old village while aligning it with modern trends.
es_es: Pero el director me dijo que sonaba demasiado a nuevo y me pidió que intentara crear la sensación de un pueblo antiguo y, al mismo tiempo, adaptarlo a las tendencias modernas.

source: But the way room portal is implemented, it's an implementation similar to things like middleware.
es_es: Pero la forma en la que se implementa el portal de salas es una implementación similar a cosas como el middleware.

source: But to help build an atmosphere of fear, we did decide on different tones.
es_es: Sin embargo, para ayudar a crear una atmósfera de miedo, sí que decidimos usar diferentes tonos.

source: By doing that, we can instill fear from things you can't see but can hear and also create atmospheric sounds, which we both treated with a lot of care in the remake.
es_es: De este modo, podemos infundir miedo con cosas que no se ven pero se oyen, y también crear sonidos atmosféricos que ambos tratamos con mucho mimo en la nueva versión.

source: Can we expect more audio tricks to be played on players?
es_es: ¿Podemos esperar más pistas de audio en los reproductores?

source: Can you discuss what that means, with examples, and why that's important to the team?
es_es: ¿Puedes explicar qué significa eso, con ejemplos, y por qué es importante para el equipo?

source: Culling is a necessary process.
es_es: La eliminación selectiva es un proceso necesario.

source: Despite my constant anxiety, I had so much fun that I welcomed every major combat encounter.
es_es: Pese a mi ansiedad constante, me lo estaba pasando tan bien que recibía con los brazos abiertos cada gran enfrentamiento.

source: Doing this allows sound occlusion and diffraction to be naturally stimulated.
es_es: De este modo, se estimula de forma natural la oclusión y difracción del sonido.

source: Environmental sound is made up of 'outside' and 'inside' sounds, which form the base of tone of that space or room tone.
es_es: El sonido ambiental se compone de sonidos "exteriores" e "interiores", que forman la base del tono de ese espacio o habitación.

source: Especially by the time I unlocked the more powerful weapons – shoutout to my semi-automatic shotgun – blowing through scores of enemies felt fantastic.
es_es: Especialmente cuando desbloqueé las armas más poderosas (un saludo a mi escopeta semiautomática), ya que acabar con hordas de enemigos se sentía fantástico.

source: Ethan Winters discovers this within minutes of setting foot in this isolated village at the foot of a medieval castle.
es_es: Ethan Winters lo descubre tras unos minutos de poner los pies en esta aldea desolada a los pies de un castillo medieval.

source: Finding a balance between those two aspects to produce RE4's sound is a difficult task, but that's the goal we, the sound team, set when we created the sound for this game.
es_es: Encontrar un equilibrio entre esos dos aspectos para producir el sonido de RE4 es una tarea difícil, pero ese es el objetivo que nos marcamos nosotros, el equipo de sonido, cuando creamos el sonido de este juego.

source: For RE4, there's a lot of freedom there.
es_es: Para RE4, hay mucha libertad.

source: For Star Wars, I love Episode 3 so much!
es_es: De Star Wars me encanta el episodio 3

source: For example, each area of the game, like the village at the beginning.
es_es: Por ejemplo, cada zona del juego, como el pueblo al principio.

source: For example, maybe a track in the original had a very strong horror feel that we instead went with a little more dramatic direction for it in the remake.
es_es: Por ejemplo, puede que un tema del original tuviera un carácter terrorífico muy marcado, pero en la nueva versión hemos optado por una dirección más dramática.

source: For gunshot sounds, I really like the ones in Ubisoft's The Division.
es_es: Para los sonidos de disparos, me gustan mucho los de The Division de Ubisoft.

source: For instance, the save theme, the merchant music; those are arrangments of the original music in the RE4.
es_es: Por ejemplo, la música de guardado o la música de compra son arreglos de la música original de RE4.

source: For instance, we have definitions for statuses like 'no enemies,' 'enemy close, but hasn't noticed the player,' or the neutral, warning or battle status.
es_es: Por ejemplo, tenemos definiciones para estados como "sin enemigos", "enemigo cerca, pero no se ha dado cuenta de la presencia del jugador", o el estado neutral, de advertencia o de batalla.

source: For players who are playing RE4 for the first time with this remake, I hope they feel the quality of this remake aligns with things like the RE2 remake and Village, which were regarded very highly.
es_es: Para los jugadores que jueguen a RE4 por primera vez con esta nueva versión, espero que sientan que tiene una calidad a la altura de la nueva versión de RE2 y Village, que fueron muy bien acogidas.

source: For the Ganado music I touched upon earlier, that concept was using a lot of noise sounds, but for another track, it could be an irregular rhythm or a creepy sound that almost sounds like a voice.
es_es: Para la música de los Ganado que he mencionado antes, el concepto era utilizar muchos sonidos de ruido, pero para otra pista, podría ser un ritmo irregular o un sonido espeluznante que casi suena como una voz.

source: For the first time since 2005, Resident Evil 4 is scary again, and I couldn't be happier.
es_es: Por primera vez desde 2005, Resident Evil 4 vuelve a dar miedo, y no podría estar más feliz.

source: For the music, can you discuss the unique challenges of iterating on an existing score?
es_es: En cuanto a la música, ¿podrías hablarnos de los retos que supone repetir una partitura ya existente?

source: For the sound effects for the enemies, was everything re-recorded from scratch?
es_es: Para los efectos de sonido de los enemigos, ¿se volvió a grabar todo desde cero?

source: For the sound of a gun shooting, the closer and closer you get to a realistic gunshot, the less and less it starts to feel good as you play the game.
es_es: En cuanto al sonido de un arma al disparar, cuanto más te acercas a un disparo realista, menos empieza a gustarte mientras juegas.

source: For the sounds that are based in the original, I think some fans out there might be able to tell which ones they are once they hear them in the game.
es_es: En cuanto a los sonidos que se basan en el original, creo que algunos aficionados podrán saber cuáles son una vez que los oigan en el juego.

source: For the sounds we recreated from scratch, we didn't just create any sounds we wanted.
es_es: De los sonidos que recreamos desde cero, no creamos así porque sí los que nosotros queríamos.

source: For the village, when I was first making the music, I was using a hybrid approach, using things like some modern synthesizers.
es_es: Cuando empecé a hacer música para el pueblo, utilizaba un enfoque híbrido, con sintetizadores modernos.

source: For things that inspire me, I would say that's usually the music from movies and dramas.
es_es: En cuanto a lo que me inspira, diría que suele ser la música de películas y dramas.

source: For this remake, we implemented it in a way we could use it throughout the whole game.
es_es: Para esta nueva versión, lo hemos implementado de forma que podamos utilizarlo en todo el juego.

source: From a technical standpoint, every area in the game exists as one of these rooms.
es_es: Desde un punto de vista técnico, cada zona del juego existe como una de estas salas.

source: From a visual and level design perspective, the Resident Evil 4 remake knows precisely when to be nostalgic and when to be fresh.
es_es: Desde la perspectiva visual y de diseño de niveles, el remake de Resident Evil 4 sabe con precisión cuándo ser nostágico y cuándo ser fresco.

source: From the jump, the remake overwhelms you with danger.
es_es: Desde el principio, el remake te inunda con el peligro.

source: Game Informer: A goal for the Resident Evil 4 remake is to create more believable soundscapes.
es_es: Game Informer: Uno de los objetivos de la nueva versión de Resident Evil 4 es crear campos de sonido más creíbles.

source: Gameplay has been expanded – namely, you can walk and aim your gun at the same time now, as well as the aforementioned parrying and new melee options – which makes the already-great bones of RE4 feel modern and fresh.
es_es: La jugabilidad se ha expandido (concretamente, ahora puedes caminar y apuntar con tu arma al mismo tiempo, además de los mencionados contraataques y nuevas opciones de combate cuerpo a cuerpo), lo cual hace que la base ya genial de RE4 se sienta moderna y fresca.

source: Going back to the direct pass, in this game, depending on the thickness or density of the wall, how much you can hear through walls will be adjusted appropriately.
es_es: Volviendo al pase directo, en este juego, dependiendo del grosor o densidad de la pared, se ajustará adecuadamente cuánto se oye a través de las paredes.

source: How did you create the sound of the las plaga exploding from a Ganado neck?
es_es: ¿Cómo creaste el sonido de la explosión de las plagas del cuello de un Ganado?

source: How did you decide it fit into the existing soundtrack?
es_es: ¿Cómo decidiste que encajaba en la banda sonora existente?
